Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: ཤཱ་རིའི་བུ་དེ་ལ་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་གི་སྔོན་དུ་འགྲོ་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ངེས་པར་རྟོག་པའི་སྔོན་དུ་འགྲོ་བའོ། ། སེམས་རྩེ་གཅིག་པའི་སྔོན་དུ་འགྲོ་བའོ། ། སེམས་གནས་པའི་སྔོན་དུ་འགྲོ་བའོ། ། སེམས་ཞི་གནས་ཀྱི་སྔོན་དུ་འགྲོ་བའོ། ། ཏིང་ངེ་འཛིན་གྱི་དབང་པོའི་སྔོན་དུ་འགྲོ་བའོ། ། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱི་སྔོན་དུ་འགྲོ་བའོ། ། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་གྱི་སྔོན་དུ་འགྲོ་བའོ། ། བསམ་གཏན་དང་རྣམ་པར་ཐར་པའི་སྔོན་དུ་འགྲོ་བའོ། ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུའི་སྔོན་དུ་འགྲོ་བའོ། ། འགོག་པ་དགུ་པའི་སྔོན་དུ་འགྲོ་བའོ། ། དགེ་བའི་ཆོས་ཀྱི་སྔོན་དུ་འགྲོ་བའོ། ། ཉོན་མོངས་པའི་དགྲ་གདུལ་བའི་སྔོན་དུ་འགྲོ་བའོ། ། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་ཡོངས་སུ་རྫོགས་པའི་སྔོན་དུ་འགྲོ་བའོ། ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྔོན་དུ་འགྲོ་བའོ། ། སངས་རྒྱས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་སྔོན་དུ་འགྲོ་བའོ། ། དེ་ལྟར་ན་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་དེ་དག་དང་ཞི་བར་བྱེད་པའི་ཆོས་གཞན་རྣམས་ཀྱི་ཡང་སྔོན་དུ་འགྲོ་བ་སྟེ།
en: “What then, Śāriputra, are the preparations for the perfection of meditation? Introspection of mind is the preparation. One-pointedness of mind is the preparation. Stability of mind is the preparation. A mind that dwells in calm abiding meditation is the preparation. The faculty of concentration is the preparation. The power of concentration is the preparation. Correct concentration is the preparation. Meditation and freedom are the preparation. The attainment of the nine successive states is the preparation. The nine cessations are the preparation. Wholesome qualities are the preparation. Overpowering one’s enemies, the vices, is the preparation. Fulfilling the skandha of concentration is the preparation. The concentration of a bodhisatva is the preparation. The concentration of a buddha is the preparation. Thus, these and other elements that produce peace are the preparations for the perfection of meditation.

source: ཤཱ་རིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། དེ་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། །
en: “This, Śāriputra, is the perfection of meditation of bodhisatvas, by which bodhisatvas, great beings, practice the way of the bodhisatva.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་དོན་དེ་ཉིད་རྒྱས་པར་བསྟན་པའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: Then, in order to clarify this point further, the Lord spoke these verses:

source: བསམ་གཏན་དང་ནི་རྣམ་ཐར་ཕ་རོལ་ཕྱིན། ། པད་མ་ཆུ་ཡིས་གོས་པ་མེད་པ་ལྟར། །ཡིད་ནི་ཆགས་མེད་དག་པ་འཇིག་རྟེན་ན། ། བསྐལ་མང་རྒྱ་མཚོར་རྟག་ཏུ་སྤྱད་པ་སྤྱོད། །
en: “They constantly train in the practice for a great ocean of eons And reach the further shore of meditation and liberation. The impurities of this world do not stick to their minds, Just as water does not stick to a lotus.

source: གང་དུ་ཏིང་འཛིན་ཕ་རོལ་སོང་བ་ཡི། རྣམ་པར་སྣང་མཛད་ཞི་བའི་ཏིང་འཛིན་དང་། །ཟླ་འོད་ཅེས་བྱ་ཏིང་འཛིན་རྣམས་བཀོད་པ། །དེ་ཉིད་གློག་གིས་རབ་ཏུ་བརྒྱན་པ་དང་། །
en: “There are concentrations called the illuminating, The peaceful, and reaching the other shore, Concentrations such as the light of the moon, the array, And adorned with bolts of lightning.

source: མངོན་པར་འཕགས་དང་དེ་བཞིན་སེམས་པ་དང་། །དྲི་མ་མེད་དང་སྣང་ལྡན་ཏིང་འཛིན་དང་། །ཡོན་ཏན་འོད་དང་གྲུབ་འོད་མྱ་ངན་མེད། ། ཆོས་རྣམས་ཐམས་ཅད་ལ་ནི་དབང་སྒྱུར་དང་། །
en: “There are concentrations called the exalted, Hero of the mind, spotless, radiance, The light of good qualities, the light of completion, The sorrowless, and control of all phenomena.

source: ཆོས་སྒྲོན་དང་ནི་དེ་བཞིན་ཆོས་དཔའ་དང་། །ཏིང་འཛིན་ཆོས་ཀྱི་དབང་ཕྱུག་རི་རབ་དཔའ། ། དམ་པའི་ཆོས་ཀྱི་ཡེ་ཤེས་དབང་བྱེད་དང་། །དམ་ཆོས་ཀུན་འཛིན་ཤིན་ཏུ་རྣམ་དག་དང་། །
en: “There are concentrations called the torch of the Dharma, The hero of the Dharma, the lord of the Dharma, the hero as great as Mount Meru, Control of the knowledge of the true Dharma, And the great purity of supporting the true Dharma.

source: གཞན་གྱི་སེམས་ལ་རྣམ་དཔྱོད་ཏིང་འཛིན་དང་། །དམ་ཆོས་དཀོན་མཆོག་འོད་ཟེར་ཏིང་འཛིན་དང་། །
en: “There are concentrations called exploring the minds of others, And the ray of light from the jewel of the true Dharma.

source: རྒྱལ་མཚན་རྩེ་མོ་དཔུང་རྒྱན་ཉོན་མོངས་སེལ། ། བདུད་ཀྱི་སྟོབས་རྣམས་འཇོམས་པའི་ཏིང་འཛིན་དང་། །
en: There are concentrations called the supreme banner ornament, Destroyer of vices, and crushing the strength out of Māra.

source: སྟོབས་བཅུ་དང་ནི་སྟོབས་ལས་མངོན་འཕགས་དང་། །ཀུན་བཅད་ཆགས་མེད་ཅེས་བྱ་ཏིང་འཛིན་དང་། །ལག་ན་སྒྲོན་མ་འདུག་སྦྱིན་བསྒྲགས་པ་དང་། །ས་འཛིན་ལེགས་པར་གནས་པའི་ཏིང་འཛིན་དང་། །
en: “There are concentrations called the ten powers, Exceptional power, and severing attachment And the concentrations called holding a lamp, the cry, The roar, the bearer of concentration, and the exceptional state.

source: རི་རབ་སྒྲོན་དང་རྒྱལ་བ་མི་འཕམ་དང་། །ཡེ་ཤེས་སྒྲོན་དང་དེ་བཞིན་མི་གཙང་དང་། །རྒྱལ་བ་ཐམས་ཅད་དྲན་པའི་ཏིང་འཛིན་དང་། །ཆོས་དྲན་དང་ནི་ཡོན་ཏན་ཡེ་ཤེས་འཇུག །
en: “There are concentrations called the lamp of Mount Meru, Insuperable victory, the torch of knowledge, The pure leader, the recollection of all the victorious ones, Remembering the Dharma, and accessing merit and knowledge.

source: སྟོང་པར་འཇུག་དང་དེ་བཞིན་མཚན་མེད་དང་། །སྨོན་མེད་ཏིང་འཛིན་དེ་བཞིན་ཞི་བའི་ས། །འདུ་ཤེས་སྣ་ཚོགས་བྲལ་ཞེས་བྱ་བ་དང་། །རབ་དུལ་ཀླུ་དབང་སྟག་ཅེས་བྱ་བ་དང་། །
en: “There are concentrations called entering into emptiness, Beyond attributes, beyond aspirations, the stage of peace, Freedom from various sentiments, And the disciplined tiger of the nāga lord.

source: འཁྱིལ་བ་དང་ནི་རྣམ་པར་ལྡོག་པ་དང་། །འཛུམས་པ་མེད་དང་སྟོབས་དང་མིག་དག་དང་། །ཏིང་འཛིན་རྡོ་རྗེ་འདྲ་དང་རྡོ་རྗེ་ས། །མངོན་འཕགས་མི་འཛུམས་ལྷུན་པོ་ལྟ་བུ་དང་། །
en: “There are concentrations called revolving, returning, The unblinking, pure in powers and sight, The vajra-like, the stage of the vajra, The exalted, and vigilant as Mount Meru.

source: rཀུན་ནས་ཀློང་འཁྱོལ་རྣམས་པར་དག་སྒྲ་དང་། །ངེས་རྟོག་ཉོན་མོངས་བྲལ་བའི་ཏིང་འཛིན་དང་། །ནམ་མཁའ་འདྲ་དང་ནམ་མཁའི་བར་སྐབས་དང་། །ཡོན་ཏན་ཐམས་ཅད་གུས་པར་ལེན་པ་དང་། །
en: “There are concentrations called ever turning, pure sound, Reflection, free from vices, The sky-like, the limits of the sky, The respect that comes from attaining all good qualities,

source: བློ་གྲོས་དྲན་རྟོགས་བློ་འཕེལ་སྤོབས་མི་ཟད། །ངེས་ཚིག་བསྟན་པ་མཐའ་ཡས་མི་ཟད་དང་། །ལེགས་བྱས་བྱས་པ་ཆུད་མི་ཟ་བ་དང་། །ལྟ་བ་དང་ནི་འགྲོ་བ་ཚིམ་བྱེད་དང་། །
en: “Mindful intelligence, mind expanding, Imperishable eloquence, giving instructions, Boundless imperishability, not going to waste, Performer of good deeds, vision, and delighting beings.

source: བྱམས་པ་མངོན་འཕགས་སྙིང་རྗེ་ཡངས་པའི་རྩ། །དགའ་དང་མཆོག་ཏུ་དགའ་བ་འཇུག་པ་དང་། །བཏང་སྙོམས་དང་ནི་གཉིས་ལ་ཆགས་གྲོལ་དང་། །ཆོས་དོན་ཆོས་ཀྱི་འོད་ཟེར་ཏིང་འཛིན་དང་། །
en: “There are concentrations called the lofty love, root of vast compassion, Empathetic joy, entering into delight, Equanimity, free from dualistic attachment, The meaning of the Dharma, the sunbeam of the Dharma,

source: འཁྲུག་མེད་ཡེ་ཤེས་སྒྲོན་དང་ཡེ་ཤེས་མཚོ། །རྣམ་གྲོལ་སྙིང་པོ་འགྲོ་བ་ཚིམ་བྱེད་དང་། །
en: “The unswerving torch of knowledge, the ocean of knowledge, The essence of emancipation, and delighting beings.

source: རྡོ་རྗེ་རྒྱལ་མཚན་པད་མའི་དམ་པ་དང་། །ཆོས་ཀྱི་རྒྱལ་དང་མི་གཡོ་ཏིང་འཛིན་དང་། །
en: There are concentrations called the vajra banner, The supreme lotus, Dharma victor, and immovable.

source: ཤེས་རབ་རྩིབས་དང་ཞི་བ་སངས་རྒྱས་མཚོ། འོད་ཟེར་མཐའ་ཡས་རྣམ་གྲོལ་སྦྱིན་པ་དང་། །ཡེ་ཤེས་ཏིང་འཛིན་དེ་བཞིན་གཤེགས་ཀྱི་རྒྱན། །བཀོད་པ་ཆེན་པོ་ཞིང་བཀོད་སྣང་བ་དང་། །
en: “There are concentrations called the spoke of wisdom, The tranquil ocean of the buddhas, the boundless rays of light, Emancipation through generosity, the concentration of wisdom, The great array of the adornments of the Tathāgata, and the blazing array.

source: སེམས་ཅན་བསམ་པ་ཡོངས་རངས་དགའ་བ་དང་། །རྫོགས་པའི་བྱང་ཆུབ་ལམ་ལ་རྟག་འཐུན་དང་། །ཕ་རོལ་ཕྱིན་པ་བརྒྱན་དང་དཀོན་མཆོག་གཙུག །ཏིང་འཛིན་བྱང་ཆུབ་ཡན་ལག་མེ་ཏོག་སྦྱིན། །
en: “There are concentrations called taking joy in the intentions of sentient beings, Always in accord with the path to awakening, Perfect adornment, crest of jewels, Giving the flowers of the factors of awakening,

source: རྣམ་གྲོལ་སྙིང་པོ་བདུད་རྩི་སྦྱིན་པ་དང་། །རླུང་དང་རླུང་བཞིན་འགྲོ་བ་མི་དམིགས་དང་། །རྒྱ་མཚོ་ཤུགས་འཛིན་རིན་ཆེན་མཛོད་ལྡན་དང་། །བྲག་དང་རི་འཐབ་རྒྱལ་པོ་ཞེས་བྱ་དང་། །
en: “The essence of emancipation, the bestower of immortality, The wind, the limbs of the wind, the nonapprehended, Supporting the churning of the ocean, treasury of wealth, And the king crushing mountains and boulders.

source: རྫུ་འཕྲུལ་ཡངས་དང་ཤིན་ཏུ་དོན་འཛིན་དང་། །སངས་རྒྱས་ཡུལ་སྟོན་ཏིང་ངེ་འཛིན་དག་དང་། །
en: “There are concentrations called vast magical abilities, Retaining the meaning, and displaying the realm of the buddhas.

source: དེ་དང་གཞན་ཡང་རྒྱ་ཆེན་མཐའ་ཡས་པའི། །ཞི་བའི་ཏིང་འཛིན་བྱེ་བ་ཁོང་དུ་ཆུད། །
en: They accomplish these and an infinite abundance Of tens of millions of other peaceful states of concentration.

source: གང་དག་བསམ་གཏན་ཕ་རོལ་ཕྱིན་སྤྱོད་པ། །བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་དཔག་མེད་དེ། །
en: “The good qualities of the bodhisatvas who practice The perfection of meditation are innumerable.

source: མཉམ་པར་བཞག་ནས་བསམ་གཏན་སྤྱོད་ཡུལ་འགྲེང་། །མཉམ་པར་བཞག་ནས་རྒོད་པ་མེད་པར་འཆག །
en: Through concentration they dwell within the spheres of meditation; Through concentration they progress without aggrandizement.

source: མཉམ་པར་བཞག་ནས་འདུག་ཅིང་ཉལ་བར་བྱེད། ། དེ་ཡི་སྤྱོད་ལམ་མཉམ་པར་མ་བཞག་མེད། །
en: “Concentrated when they sit and when they sleep, They do not lose composure in their practice.

source: མཉམ་པར་བཞག་པས་སྒྲ་ནི་འབྱིན་བྱེད་དེ། ། ཆོས་འདི་ཐམས་ཅད་ཞི་དང་རབ་ཞི་བ། །
en: Concentrated when they speak, All these phenomena are pacified and calmed.

source: རྟག་པ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད། །
en: “They do not engage in mental constructions or conceptualizations.

source: བདག་མེད་སྲོག་མེད་དབང་ཕྱུག་དག་ཀྱང་མེད། །
en: For them there is no self, no life force, and no God.

source: བྱང་ཆུབ་སེམས་དཔའ་མཁས་པ་སྙིང་རྗེ་ཅན། །བསམ་གཏན་ཕ་རོལ་ཕྱིན་པ་སྤྱོད་བྱེད་པ། །ཡོན་ཏན་རྒྱ་མཚོ་དེ་ཡི་ཡོན་ཏན་ནི། །འདི་དང་གཞན་ཡང་ཕ་རོལ་མཐའ་ཡས་པའོ། །
en: “Wise bodhisatvas, filled with empathy for sentient beings, Who practice the perfection of meditation Possess these and other good qualities Of the boundless ocean of good qualities.”

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ་སྟེ་བཅུ་པའོ།། །།
en: This is the tenth chapter, “The Perfection of Meditation.”

source: བམ་པོ་བཅུ་བདུན་པ།
en: Chapter 11:

source: །ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ལ་བརྩོན་ན་ བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཞེ་ན།
en: “Now, Śāriputra, what is the bodhisatvas’ perfection of wisdom like, the perfection of wisdom by means of which bodhisatvas, great beings, practice the way of the bodhisatva?

source: ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་རབ་ཏུ་ཉན་པར་བྱེད། འཛིན་པར་བྱེད། འཆང་བར་བྱེད། ཀློག་པར་བྱེད། ཀུན་ཆུབ་པར་བྱེད། གཞན་དག་ལ་ཡང་འཆད་ཅིང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་སྟོན་པར་བྱེད་དེ། ཤཱ་རིའི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཤིན་ཏུ་མཉན། བླངས། བཟུང་། བཀླགས། གཞན་ལ་ཡང་བཤད་ཅིང་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བསྟན་ན་ཤེས་རབ་ཀྱི་རྣམ་པ་འདི་དག་འཐོབ་པར་འགྱུར་རོ། །
en: Śāriputra, the bodhisatva conscientiously studies the cycle of teachings contained in The Collected Teachings on the Bodhisatva; he learns it, memorizes it, reads it, absorbs it, clarifies it to others, and teaches it in great detail. When he has conscientiously studied the cycle of teachings contained in The Collected Teachings on the Bodhisatva, when he has learned it, memorized it, read it, clarified it to others, and taught it in great detail, he develops the different aspects of wisdom.

source: ཤེས་རབ་དེ་ཡང་རྣམ་པ་དང་འཇུག་པ་གང་ཞེ་ན། དེ་ལ་ཤེས་རབ་ཀྱི་ཐོས་པ་ནི་རྣམ་པའོ། ། ཚུལ་བཞིན་ཡིད་ལ་བྱེད་པ་ནི་འཇུག་པའོ། ། ཐོས་པ་ཡང་རྣམ་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ་འདུན་པའི་རྣམ་པ་དང་། བསམ་པའི་རྣམ་པ་དང་། སྦྱོར་བའི་རྣམ་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་རྣམ་པ་དང་། ང་རྒྱལ་མེད་པའི་རྣམ་པ་དང་། རབ་ཏུ་འདུད་པའི་རྣམ་པ་དང་། རི་མོར་བྱེད་པའི་རྣམ་པ་དང་། འཐུན་པའི་རྣམ་པ་དང་། བཀའ་བློ་བདེ་བའི་རྣམ་པ་དང་། བསྙེན་བཀུར་བྱེད་པའི་རྣམ་པ་དང་། རྣ་བླགས་ཏེ་ཉན་པའི་རྣམ་པ་དང་། བཀུར་སྟི་བྱེད་པའི་རྣམ་པ་དང་། ཡིད་ལ་བྱེད་པའི་རྣམ་པ་དང་། མི་གཡེང་བའི་རྣམ་པ་དང་། རིན་པོ་ཆེར་འདུ་ཤེས་པའི་རྣམ་པ་དང་། སྨན་དུ་འདུ་ཤེས་པའི་རྣམ་པ་དང་། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའི་འདུ་ཤེས་ཀྱི་རྣམ་པ་དང་། དྲན་པའི་སྣོད་ཀྱི་རྣམ་པ་དང་། རྟོགས་པ་ཤེས་པའི་རྣམ་པ་དང་། བློ་གྲོས་འདོད་པའི་རྣམ་པ་དང་། བློ་ལ་འཇུག་པའི་རྣམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐོས་པས་མི་ངོམས་པའི་རྣམ་པ་དང་། གཏོང་བ་སྤེལ་བའི་རྣམ་པ་དང་། བྱིན་ནས་ མི་སྨོད་པའི་རྣམ་པ་དང་། མང་དུ་ཐོས་པ་སྟེན་པའི་རྣམ་པ་དང་། གུས་པར་དགའ་བ་མྱོང་བར་བྱེད་པའི་རྣམ་པ་དང་། ལུས་སིམ་པའི་རྣམ་པ་དང་། སེམས་རངས་པའི་རྣམ་པ་དང་། མི་སྐྱོ་བར་ཉན་པའི་རྣམ་པ་དང་། དོན་ཉན་པའི་རྣམ་པ་དང་། ཆོས་ཉན་པའི་རྣམ་པ་དང་། ནན་ཏན་ཉན་པའི་རྣམ་པ་དང་། ཐེག་པ་གཞན་ལ་འདོད་པ་མེད་པར་ཉན་པའི་རྣམ་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉན་པའི་རྣམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཉན་པའི་རྣམ་པ་དང་། བསྡུ་བའི་དངོས་པོ་ཉན་པའི་རྣམ་པ་དང་། ཐབས་མཁས་པ་ཉན་པའི་རྣམ་པ་དང་། ཚངས་པའི་གནས་པ་ཉན་པའི་རྣམ་པ་དང་། མངོན་པར་ཤེས་པ་ཉན་པའི་རྣམ་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་ཉན་པའི་རྣམ་པ་དང་། ཡང་དག་པར་སྤོང་བ་ཉན་པའི་རྣམ་པ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་ཉན་པའི་རྣམ་པ་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཉན་པའི་རྣམ་པ་དང་། མི་རྟག་པ་ཉན་པའི་རྣམ་པ་དང་། སྡུག་བསྔལ་བ་ཉན་པའི་རྣམ་པ་དང་། བདག་མེད་པ་ཉན་པའི་རྣམ་པ་དང་། ཞི་བ་ཉན་པའི་རྣམ་པ་དང་། སྟོང་པ་ཉིད་ཉན་པའི་རྣམ་པ་དང་། མཚན་མ་མེད་པ་ཉན་པའི་རྣམ་པ་དང་། སྨོན་པ་མེད་པ་ཉན་པའི་རྣམ་པ་དང་། མངོན་པར་འདུ་མི་བྱེད་པ་ཉན་པའི་རྣམ་པ་དང་། དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱེད་པ་ཉན་པའི་རྣམ་པ་དང་། རང་དབང་དུ་གྱུར་པའི་རྣམ་པ་དང་། ཆོས་ཉན་པར་འདུ་ཤེས་པའི་རྣམ་པ་དང་། ཀུན་ཏུ་འདྲེ་བ་མི་འཐུན་པའི་ཕྱོགས་སུ་འདུ་ཤེས་པའི་རྣམ་པ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཚར་གཅོད་པའི་རྣམ་པ་དང་། མཁས་པ་ལ་མངོན་པར་དགའ་བའི་རྣམ་པ་དང་། འཕགས་པ་བསྟེན་པའི་རྣམ་པ་དང་། འཕགས་པ་མ་ཡིན་པ་ཡོངས་སུ་སྤང་བའི་རྣམ་པ་དང་། འཕགས་པ་ཉན་པའི་རྣམ་པ་དང་། དབང་པོ་ཉན་པའི་རྣམ་པ་དང་། རྗེས་སུ་དྲན་པ་སྒོམ་པ་ཉན་པའི་རྣམ་པ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཉན་པའི་རྣམ་པ་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཉན་པའི་རྣམ་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཆེན་པོ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་རྣམས་ཉན་པའི་རྣམ་པ་སྟེ། ཤཱ་རིའི་བུ་དེ་ལྟར་གང་ན་ཐོས་པ་དེ་ན་ཤེས་པའོ། ། གང་ན་ཤེས་པ་དེ་ན་ནན་ཏན་ནོ། །
en: “Now, what are the different aspects of this wisdom, and how should one engage with it? The different aspects of wisdom involve learning, and one should engage with it in a non-superficial way. Now, what are the different aspects of learning? They are inclination, motivation, engagement, spiritual friendship, not being conceited, reverence, respect, skill, being receptive, being favorable, being attentive, veneration, being mentally engaged, being unmoving, considering wisdom to be a jewel, considering it to be medicine, considering it to be what alleviates all sickness, the vessel of mindfulness, the knowledge that comes from understanding, a radiant intellect, intellectual engagement, being insatiable when learning about the qualities of the Buddha, the nourishment of renunciation, delighting in being generous, relying on great learning, experiencing joy when one pays reverence, being content in one’s body, mental joy, learning without becoming weary, learning the meaning, learning the Dharma, learning with enthusiasm, learning without being drawn toward other vehicles, learning the perfections, learning The Collected Teachings on the Bodhisatva, learning the methods for bringing people together, learning skillful means, learning about the pure states, learning the superior abilities, learning how to establish mindfulness, learning genuine renunciation, learning the foundations of magical abilities, learning about dependent origination, learning about impermanence, learning about suffering, learning about nonself, learning about tranquility, learning about emptiness, learning about freedom from attributes, learning about freedom from aspirations, learning about the lack of conditions, learning about the conditions needed for roots of virtue, independence, thinking that one wants to learn about the Dharma, considering association with certain kinds of people to be unsuitable, thinking that one wants to counteract all the vices, delighting in those who are learned, relying on the noble ones, avoiding those who are not noble, learning about the noble ones, learning about the faculties, learning about the cultivation of mindfulness, learning about the factors of awakening, learning about the eightfold path, and understanding the Tathāgata’s powers, confidence, great love, great compassion, great empathetic joy, equanimity, and analytical abilities and his eighteen unique buddha qualities. Śāriputra, someone who is learned in these things possesses knowledge, and where there is knowledge, insight progresses.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། གང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ལ་མོས་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ལ་བསམ་པ་ཡོད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ལ་སྦྱོར་བ་ཡོད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་དགེ་བའི་བཤེས་གཉེན་ལ་སྟེན་པར་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་ང་རྒྱལ་མེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་མང་དུ་ཐོས་པ་ལ་རབ་ཏུ་འདུད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་མང་དུ་ཐོས་པ་ལ་རི་མོར་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་འཐུན་པར་འཛིན་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་བཀའ་བློ་བདེ་བ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་མང་དུ་ཐོས་པ་ལ་བསྙེན་བཀུར་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་རྣ་བླགས་ཏེ་ཉན་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་མང་དུ་ཐོས་པ་ལ་བཀུར་སྟི་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་འཆད་པ་དང་། གང་མང་དུ་ཐོས་པ་ཡིད་ལ་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་མང་དུ་ཐོས་པ་རིན་པོ་ཆེར་འདུ་ཤེས་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་མང་དུ་ཐོས་པ་ལ་རྩིར་འདུ་ཤེས་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་མང་དུ་ཐོས་པ་ཐོས་ནས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་གཏི་མུག་རབ་ཏུ་ཞི་བར་འདུ་ཤེས་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་མང་དུ་ཐོས་པ་ཐོས་ནས་འཛིན་པར་འདུ་ཤེས་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་ཆོས་རྣམས་རྟོགས་པར་ཁོང་དུ་ཆུད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། ། གང་མང་དུ་ཐོས་པ་བློ་གྲོས་འདོད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: “Why is this? Someone who is inclined toward the cycle of teachings contained in The Collected Teachings on the Bodhisatva will study, and so he will develop understanding. He will learn, and so his insight progresses. Someone who is dedicated to the cycle of teachings contained in The Collected Teachings on the Bodhisatva will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who engages with the cycle of teachings contained in The Collected Teachings on the Bodhisatva will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who relies upon spiritual friends will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who is not conceited will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who holds on to what is beneficial will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who is receptive will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who shows reverence for great learning will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who is attentive will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who has veneration for great learning will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who is mentally engaged with great learning will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who sees great learning as a jewel will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who sees great learning as medicine will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who sees that absorbing great learning will lead to the pacification of desire, anger, and confusion will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who absorbs a great deal of learning with the intention of retaining it will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone who attempts to arrive at an understanding of phenomena will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses. Someone whose mind yearns for great learning will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་མང་དུ་ཐོས་པ་ཐོས་ནས་བློ་རྣམ་པར་གཡོ་བ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who absorbs great learning and whose intellect is agile will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་ཐོས་པས་མི་ངོམས་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who is not satisfied with his learning will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་སྦྱིན་པའི་གཏམ་ཐོས་ནས་གཏོང་བར་རྟོག་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who listens to talks about generosity and becomes motivated to give things up will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་ཚུལ་ཁྲིམས་ཀྱི་གཏམ་ཐོས་ནས་ཚུལ་ཁྲིམས་སྲུང་བ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who listens to talks about morality and then guards his morality will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་བཟོད་པའི་གཏམ་ཐོས་ནས་བཟོད་པར་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who listens to talks about patient acceptance and who is patient will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་བརྩོན་འགྲུས་ཀྱི་གཏམ་ཐོས་ནས་བརྩོན་འགྲུས་མཉམས་པར་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who listens to talks about vigor will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.

source: གང་བསམ་གཏན་གྱི་གཏམ་ཐོས་ནས་སེམས་མི་གཡེང་བར་བྱེད་པ་དེ་ནི་ཐོས་པར་འགྱུར་རོ། ། ཐོས་ནས་རབ་ཏུ་ཤེས་སོ། ། ཤེས་ནས་ནན་ཏན་བྱེད་དོ། །
en: Someone who listens to talks about meditation and does not let his mind wander will learn. As he learns he will develop understanding, and as he develops understanding his insight progresses.
